
//https://fastcolor.ru/plakaty-postery-afishi PARSE PRICES
function showJSON(json) {
    if (typeof json != 'string') {
        json = JSON.stringify(json, undefined, '\t');
    }

    var 
        arr = [],
        _string = 'color:green',
        _number = 'color:darkorange',
        _boolean = 'color:blue',
        _null = 'color:magenta',
        _key = 'color:red';

    json = json.replace(/("(\\u[a-zA-Z0-9]{4}|\\[^u]|[^\\"])*"(\s*:)?|\b(true|false|null)\b|-?\d+(?:\.\d*)?(?:[eE][+\-]?\d+)?)/g, function (match) {
        var style = _number;
        if (/^"/.test(match)) {
            if (/:$/.test(match)) {
                style = _key;
            } else {
                style = _string;
            }
        } else if (/true|false/.test(match)) {
            style = _boolean;
        } else if (/null/.test(match)) {
            style = _null;
        }
        arr.push(style);
        arr.push('');
        return '%c' + match + '%c';
    });

    arr.unshift(json);

    console.log.apply(console, arr);
}



let parse = (double=false) => {
	let prices = {
		prices: [],
		counts: [],
		doubleSidePrices: []
	}
	let costs = document.body.querySelector("tbody")
	let props = document.body.querySelector(".col-lg-10")

	let arrRows = [ ...costs.children ]

	arrRows.forEach(r=>{
		let rows= [ ...r.querySelectorAll("td")]
		rows.forEach((td, index)=>{
			switch(index) {
				case 0: prices.counts.push(td.textContent)
				break;
				case 1: prices.prices.push(td.textContent)
				break;
				case 2: double ? prices.doubleSidePrices.push(td.textContent) : null
			}
		}) 
	})
	let wrapper = props.querySelector("p")
	let strongs = [...wrapper.querySelectorAll('strong')]


	let text = JSON.stringify(JSON.parse(JSON.stringify(wrapper.textContent)))

	let pattern = []
	strongs.forEach(s=>{
		pattern.push(s.textContent)
	})

	let patternString = pattern.join("|")

	var regEx = new RegExp(patternString+'|\s:', 'gi');
	let texts = text.replace(regEx, "").slice(2).split(":")
	texts.forEach((text, index)=>{
		prices[pattern[index]] = text
	})

	return JSON.parse(JSON.stringify(prices))

}



export const productsAndServices = [

	categories: [
		"Деловая полиграфия",
		"Календари",
		"Рекламная полиграфия",
		"Полиграфия для HoReCa",
		"Многостраничная продукция",
		"Праздничная полиграфия",
		"Сувенирная полиграфия",
		"Упаковка и POSM",
		"Широкоформатная печать"
	],


	"Деловая полиграфия": [

		"Визитки":[
			{	
				"Формат": "50 х 90 мм"
				"Печать": "полноцветная с одной / двух сторон (4-0 / 4-4)"
				"Материал": "Мелованный картон 300 г/м²",
				"Цены":  {
					counts : [
						50, 
						100, 
						150,
						200, 
						300, 
						50 
					]
					prices : [
						143, 
						197, 
						253, 
						308, 
						418, 
						638
					]
					doubleSidePrices : [
						120, 
						160,
						200, 
						240, 
						320, 
						480
					]
				}
			},
			{	
				"Формат": "50 х 90 мм"
				"Печать": "полноцветная с одной / двух сторон (4-0 / 4-4)"
				"Материал": "Мелованный картон 300 г/м²",
				"Цены":  {
					counts : [
						50
						100
						150
						200
						300
						500
								]
					prices : [
						137
						213
						251
						327
						442
						709
					]
					doubleSidePrices : [
						152
						243
						288
						380
						517
						836
					]
				}
			},
		],
	
		"Бланки":[
			{
				"Цены": [
					"679",
					"1 022",
					"1 881",
					"2 744",
					"3 602",
					"4 724",
					"6 516",
					"2 993"
				],
				"counts": [
					"30",
					"50",
					"100",
					"150",
					"200",
					"300",
					"500",
					"1000*"
				],
				"doubleSidePrices": [],
				"Формат": " А4 210 х 297 мм\\n",
				"Печать": " 4-0, полноцветная с одной стороны\\n",
				"Бумага": " офсетная 80 г/м² \""
			}

		],
		"Папки":[
			{
				"Цены": [
					"4-0",
					"2 876",
					"4 046",
					"6 906",
					"10 945",
					"20 468"
				],
				"counts": [
					"Тираж",
					"30",
					"50",
					"100",
					"200",
					"500*"
				],
				"doubleSidePrices": [
					"4-4",
					"3 986",
					"5 756",
					"10 062",
					"15 874",
					"28 178"
				],
				"Формат": " 215 х 299 x 5 мм\\n",
				"Печать": " полноцветная с одной / двух сторон\\n",
				"Картон": " Мелованный  300 г/м²\""
			}

		],
		"Конверты":[

			{
				"Цены": [
					"968 / 19,4",
					"1 640 / 16,4",
					"2 817 / 14,1",
					"3 995 / 13,3",
					"6 335 / 12,7",
					"–"
				],
				"counts": [
					"50",
					"100",
					"200",
					"300",
					"500",
					"1000*"
				],
				"doubleSidePrices": [
					"–",
					"–",
					"–",
					"–",
					"6 292 / 12,6",
					"8 713 / 8,7 "
				],
				"Формат": " С4 324 х 229 мм\\n",
				"Печать": " 4-0, полноцветная с одной стороны\\n",
				"Материал конверта": " Офсетная Бумага 80 г/м², без окна\""
			},
			{
				"prices": [
					"765 / 15,3",
					"1 234 / 12,3",
					"2 010 / 10,0",
					"2 786 / 9,3",
					"4 330 / 8,7",
					"–"
				],
				"counts": [
					"50",
					"100",
					"200",
					"300",
					"500",
					"1000"
				],
				"doubleSidePrices": [
					"–",
					"–",
					"–",
					"–",
					"4 750 / 9,5",
					"6 138 / 6,1"
				],
				"Формат": " С5 229 х 162 мм\\n",
				"Печать": " полноцветная с одной стороны\\n",
				"Материал конверта": " Офсетная Бумага 80 г/м², без окна\""
			},

			{
				"prices": [
					"727 / 14,5",
					"1 158 / 11,6",
					"1 859 / 9,3",
					"2 560 / 8,5",
					"3 995 / 7,9",
					"–"
				],
				"counts": [
					"50",
					"100",
					"200",
					"300",
					"500",
					"1000"
				],
				"doubleSidePrices": [
					"–",
					"–",
					"–",
					"–",
					"4 605 / 9,2",
					"5 909 / 5,9"
				],
				"Формат": " С65 229 х 114 мм или Е65 220 х 110 мм\\n",
				"Печать": " 4-0, полноцветная с одной стороны\\n",
				"Материал конверта": " Офсетная Бумага 80 г/м², без окна\""
			}
		],
		"Блокноты":[
			{
				"prices": [
					"1-0",
					" ",
					" ",
					" ",
					" ",
					" ",
					" "
				],
				"counts": [
					"Тираж",
					"30",
					"50",
					"100",
					"200",
					"300",
					"500"
				],
				"doubleSidePrices": [
					"4-0",
					"6 798",
					"9 009",
					"14 537",
					"23 621",
					"31 839",
					"48 253"
				],
				"Формат": " 210х297 мм\\n",
				"Объем блока": " 40 листов\\n",
				"Печать блока": " ч/б с одной стороны / полноцветная с одной стороны\\n",
				"Блок": " Бумага офсетная 80 г/м²\\n",
				"Обложка и подложка": " Мелованный картон 300 г/м²\\n",
				"Печать бложки и подложки": " полноцветная с одной стороны (4-0)\\n",
				"Крепление": " пружина по короткой стороне\""
			},
			{
				"prices": [
					"1-0",
					" ",
					" ",
					" ",
					" ",
					" ",
					" "
				],
				"counts": [
					"Тираж",
					"30",
					"50",
					"100",
					"200",
					"300",
					"500"
				],
				"doubleSidePrices": [
					"4-0",
					"5 595",
					"6 977",
					"10 450",
					"16 640",
					"22 292",
					"33 041"
				],
				"Формат": " 147х210 мм\\n",
				"Объем блока": " 40 листов\\n",
				"Печать блока": " ч/б с одной стороны / полноцветная с одной стороны\\n",
				"Блок": " Бумага офсетная 80 г/м²\\n",
				"Обложка и подложка": " Мелованный картон 300 г/м²\\n",
				"Печать бложки и подложки": " полноцветная с одной стороны (4-0)\\n",
				"Крепление": " пружина по короткой стороне\""
			},
			{
				"prices": [
					"1-0",
					"3 131",
					"5 903",
					" ",
					" ",
					" ",
					" "
				],
				"counts": [
					"Тираж",
					"30",
					"50",
					"100",
					"200",
					"300",
					"500"
				],
				"doubleSidePrices": [
					"4-0",
					"5 127",
					"6 145",
					"8 777",
					"13 340",
					"17 828",
					"26 096"
				],
				"Формат": " 105х147 мм\\n",
				"Объем блока": " 40 листов\\n",
				"Печать блока": " ч/б с одной стороны / полноцветная с одной стороны\\n",
				"Блок": " Бумага офсетная 80 г/м²\\n",
				"Обложка и подложка": " Мелованный картон 300 г/м²\\n",
				"Печать бложки и подложки": " полноцветная с одной стороны (4-0)\\n",
				"Крепление": " пружина по короткой стороне\""
			}
		],
		"Грамоты, сертификаты",
		"Презентации",
		"Бейджи",
		"Черно-белая печать",
	],

	"Календари": [
		"Календари «трио»",
		"Настенные календари-плакаты",
		"Настенные перекидные календари",
		"Настольные календари-домики",
		"Перекидные календари-домики",
		"Календари-пирамидки",
		"Карманные календари",
		"Необычные календари",
		"Магнитные календари",
	],

	"Рекламная полиграфия": [
		"Буклеты",
		"Листовки",
		"Флаеры, билеты",
		"Плакаты, постеры",
		"Стикеры, наклейки",
		"Папки-регистраторы",
		"Кубарики",
		"Дисконтные карты",
		"Скретч-карты, лотереи"
	],

	"Полиграфия для HoReCa": [
		"Папки меню",
		"Папки-счет",
		"Меню для ресторанов",
		"Меню караоке",
		"Тейблтенты",
		"Плейтс-листы, салфетки",
	],

	"Многостраничная продукция": [
		"Журналы",
		"Брошюры",
		"Каталоги",
		"Годовые отчёты",
		"Книги малыми тиражами",
		"Газеты",
		"Корпоративные издания",
		"Фотоальбомы, фотокниги",
	]
		











]